---
kind: method
id: M:Autodesk.Revit.DB.Parameter.AsValueString(Autodesk.Revit.DB.FormatOptions)
zh: 参数、共享参数
source: html/b339e4f2-847b-c73a-91a6-034b134d30e7.htm
---
# Autodesk.Revit.DB.Parameter.AsValueString Method

**中文**: 参数、共享参数

Get the parameter value as a string with units.

## Syntax (C#)
```csharp
public string AsValueString(
	FormatOptions formatOptions
)
```

## Parameters
- **formatOptions** (`Autodesk.Revit.DB.FormatOptions`) - Options for formatting the string.

## Returns
The string that represents the parameter value.